OpenFOAM-3.0.1/chapter2/ellipsoidal/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
	internalFields 
	{
	field	alpha.water;
	expression "0";
	condition "pow(pos().x,2) + pow(pos().y,2)+pow(pos().z-0.008,2) <= pow(0.004,2)";
	keepPatches	1;
	}
);
